#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=488e3989-0e02-4ba1-aa6d-ca48f11c9fc5]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ae916d49-4606-4e9c-af45-71f98d8b57af]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce475809-4d67-4814-b5cc-a79e02daae50]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95edc824-5533-47ea-9224-6997adf57152]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80d34657-7917-444a-9153-a6ddd84cc2da]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=04fe619b-7246-4a95-a449-19a2d1f26746]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5ad85904-0600-416b-8440-2dad61e3c18b]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b6e462a4-feee-4cd9-bf22-c66c32d86811]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f134767a-bca2-43ca-9759-1c3c3ab11331]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c0369e84-01ea-42c2-9c88-c8b1c93a8123]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ed0f60bd-8986-425a-a7d6-c81d2b82966c]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d2d0dc53-54b9-4990-996e-b1fbc6b28223]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=38d3dd6c-7180-480a-8c32-8c48e7dcfadf]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=75087273-e5b5-4ade-b157-70c6ebe829b8]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1772ede9-79d6-484d-a32b-8f27a3ff202e]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1463e80-9214-4c5d-8a03-bda5a5828681]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8b36b590-1b54-48b5-9902-883ea3376b01]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=35d44640-1799-439a-a15f-a40a5c40ede2]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ce3053ff-d553-4b63-bfd1-3b82f87f977c]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f98f3160-11ea-4771-a101-a31f444f2a5d]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b4043d02-4132-4deb-b0ff-719e959bb797]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e3683e2-7310-407f-91f6-3a64297dc90b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f2e7cb5-4203-45e8-97bf-26e62a071753]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b8feccbc-035d-4aa1-9699-50ecd51667bf]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=03840481-4a87-4274-ad09-f53b7e14f92d]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0bcdff5c-7e36-466e-807d-489d49ba4f46]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=693e1fb8-b0f1-4500-85d8-79da11fb6b90]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a6bd66c9-e4c7-4d35-9acb-bef15f87422e]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04c90f04-4224-4962-bd11-9e9ba98dafc5]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2713135b-243f-481e-97be-640c34b23892]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=67456bfc-9955-4e2e-adbe-29f23fe93297]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d6262e46-cb71-4e9d-b8a1-890173b2109d]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=82be4825-528a-4d35-89c1-6b612acad0e9]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f137a67a-d37e-4cfb-80c7-7cebbee7dda8]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dba26b00-e3d2-42d6-a77b-3ca68d240f8c]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60b4e3b4-5913-431f-bb01-bd94f9822d6f]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c81f44b-199f-4958-9041-7597f7acefd5]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=380b3c9f-2698-4bbb-9484-9ef2031fed55]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a8528ccb-998e-4ca8-923b-ff4b66258cab]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3928016b-9993-4ae4-8f5a-f2c988710f6b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea90df44-6f29-4da4-b3f0-b7cf51b2f87d]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=59886227-c5cc-4819-b346-ff3853c8d3f4]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=edb9b7eb-a870-42b6-8fcb-ce214e846d92]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0a92d5-c80d-405d-806d-395d38edf809]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=025f37e1-5d37-49c5-b919-150b46545b0b]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9bf13edb-d5fd-4179-914a-70bfe1ddd84b]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5daa440c-9b6e-4a86-b1b2-aec7db902f8e]
module.keycloak_dev.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0f2d9210-5c7c-4d1d-9831-1ddbdbd3bc56]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=475b8ae4-62e0-4635-aeae-1faeda2a2f89]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f3e28fc6-db24-4da6-b1cc-8d5c7626dd33]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f685c254-23b3-4c35-a608-0fa5d181b4e9]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c05e19d7-97f3-4bc6-bb4c-4ad1e55e33c1]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=953cae08-cf43-4838-8f62-01114f55e631]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=13b43351-9b51-421f-9482-5baece73e1b7]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=05815902-8e7c-4815-a238-8c0cd3baa1ca]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8194373f-83a9-4466-95e7-0079b180a298]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ed49f5c2-0ef8-4139-988c-487aff1ace0f]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fa37be77-a688-4e85-aee1-8fc1892b12cd]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c8ce7f6f-d5a0-4024-bff8-a9161f96eeb5]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4b0632ef-ced9-41ed-888a-473fab429cf5]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ef161232-e0cc-4960-ae44-26cc662473c6]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ab594d1-a6ed-41f0-8466-5b234ffcfb49]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=af70a806-df72-4c9f-a6c4-0cef832e279e]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=33aafe72-f21e-4325-a629-9ab2762ae58e]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=eef5f96b-719a-4a6e-801c-5ca03d650a76]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e8cf9c4-21fd-40c0-bbab-aa919486f2bf]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2b69c1a3-2c26-488c-88e9-3ad41345dcae]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ddf4a5f5-be5f-44a7-b6e5-382ea1098b6a]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1bf74a67-5f9a-44e2-acf4-398d92978a21]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=35e9a0b2-f32d-4127-a114-e96b6ea2092f]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d851f77-9abe-499c-b6c1-85c82800140b]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=01f34eee-1a4d-4f22-92b1-e08852badc69]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ea249887-de57-4258-b6f4-b70aae7848d8]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bbf1856-ce26-4a86-87a2-8e83330980f3]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c8226787-b58b-499f-b0a6-d883fa768e0e]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=47f1083e-cf1d-4a5a-9298-b56542faec7d]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7efc0fe3-e80e-4025-87f1-93c7f180563c]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f824abd2-5a8e-44eb-9388-7b1793d789eb]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95782915-996a-4aaf-bd09-fa129b68b157]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a3c30d8-a46c-4cee-a25f-fd205b3ab4c4]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=200efa40-594c-47c8-9a5d-a36c3764c67a]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3da82ce8-fc93-43ab-b2c2-ee962751fed4]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1c162e94-e149-427b-8bf8-48d2afc9a818]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95b23cb8-5248-45e5-bd23-9195bdd0131c]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b72b63a8-c47f-4b8f-9b2a-7fa98afc6d21]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9992e76a-992d-4f0c-948c-c9f7a4b3e50c]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fbc74ef-069e-4d0e-8003-28336fd88871]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3b66219f-1beb-4688-9de0-8ac90bf88f05]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=03d42548-58a2-4750-a43b-d832f4c9cb17]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bd8c6ab7-d79f-4554-a338-24e81dc53946]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4a6406b5-4e77-491b-ab48-0839fb65c44a]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f88ab6d3-ac51-4f37-b8ca-d641cf90c4b0]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eceb3f1d-925d-46b6-8fd1-2ba30696184f]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e2ffe2c8-b585-44a4-a875-bbcb78d492bf]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=53091167-9140-484c-af51-53a4bcd5c6b1]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=923bb5f0-6d5b-4be4-864c-8abe19e58ece]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f3750d0-c7a3-47df-9a20-4b9788f29b26]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8715f942-34e8-47cd-baa2-58b95fcdff26]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=04411df5-8c03-46d9-ad8a-2e494a48e467]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c0c370f9-04ad-4b39-9b29-af66bdbfff9d]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3080342-cba8-493a-8c3a-198a6a586c55]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f6fcf3e9-778c-491e-8482-3773cd5a9ee5]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=887a1d3c-2067-4c27-9c60-40841ac65ea0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=104f9324-8fc2-4299-a9e0-0af62757ef4f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0f62154c-1183-44ca-95cb-a20c2e686dd7]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b3a684f3-c389-4f7e-870e-7b2a95c7bb5d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=abc87253-72c8-4f2f-91da-00d2d13553a6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f4c3f563-6f38-4fca-9362-1f4655190dc0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9d03db7e-777d-436d-9a75-1b310507c1ee]
module.keycloak_dev.module.onestopauth.module.client_jon-test-8-108.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b73e0b9-6078-44a7-9a3b-9667590c26a1]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=51eec217-7aa0-4bfd-861c-7cd2e5064aa2]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=654845a7-6c0f-4f35-a6e2-3e294f950796]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4a1b87b-821d-4f4c-a172-a2bc86c2c47f]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6559f40b-de9f-4e0f-b17e-0906b7e8a59c]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4903cbe7-9a32-4685-af3a-47f923e24830]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b77524bf-68df-4f6c-aee4-985191bc1845]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=76d86a6b-d6bb-49d6-a1f9-6feb760834b2]
module.keycloak_dev.module.onestopauth.module.client_test-project-1260.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5b249681-e9d3-45da-9c5c-7a26344bd2e9]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=25f0ebd0-2a7d-4508-a203-33e1086fa924]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dd617ca7-a541-4cbb-9705-c461063c7813]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e641e62-f666-4ae8-acce-63fd6f17801b]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7addef10-3fe8-4a78-b18d-da571197412b]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=926b33b4-ecb2-4e1a-b1e8-7f27266eaa9b]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d8ff5964-aa80-41af-8c21-9261010c0d2c]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0cd6a6d4-be26-4643-b2dc-a05bb0841e98]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fcfcf6f6-f1e3-4fd5-b1f0-e96622d25d1e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a74c851-8d61-4c6f-a9cb-c391aae49297]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6faae13d-1853-4137-a10c-4c8cd7e98719]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=58c3abf5-274a-4d78-ba65-805228c03c6e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=462c309a-1e1e-49f9-ad15-0dca06081da5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1294a75a-f919-443a-b6c4-21aec8df64f3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf046218-5d2d-4ed0-9eb5-3e429509882a]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b1aee37e-eca0-4bd4-95f5-44ae0a90e483]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4eb5ebb4-f239-4a9e-ac84-59f97eaa23ae]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0dd83f5c-feb0-4ac6-89a3-88b1363ef7fa]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a8f0845d-3dcc-4f68-ac43-6aed7c24585b]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6971a234-3a0e-47e2-b549-e8a7ae5e367d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2c867a7c-6bb9-47e4-8a77-9b42287ddc37]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=290220ea-ef5f-4ac6-b0e5-b88166663764]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d058fe11-6224-4fc5-97c2-62988aef65f2]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f5369bbd-9ecd-4006-a057-24f6cbb64134]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c5b50685-dcf0-4ae2-80e3-308fb016a207]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=89f0f00a-4245-4585-91f1-aa0a4551eefa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d180ba6d-7098-404d-a86e-9e252481ee86]
module.keycloak_dev.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=59e7f169-a2f2-417c-a9ce-323c65d3c249]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=80940e30-42be-4887-ab72-5b7f31e072af]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d0a04aa7-692f-4587-9db6-c72c3d142cd0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dc0df537-05cc-4a02-b231-9544e3e599fa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e94d9706-7ecd-4ab4-8f09-3b866230d416]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=698074be-0922-4eb6-b488-412f05219620]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c37d3cfd-5c6f-4c27-9840-398c76c59ece]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6f0963ae-5fe1-4179-ab44-cd1a269683ef]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d339be32-bd09-4291-978e-06ee0d4b9096]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8f8f3010-ac19-492e-a56a-102c858c2a9a]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=de2a665b-a224-420b-ac45-4e6529c40910]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cf16a227-3a88-423b-a540-33dc159b71f7]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56796eb1-3243-413d-9626-254d74182785]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e7844f14-f7d9-41b0-bc40-804a8eb78e51]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2b936ef8-5b9c-4301-a9bb-bdd575827085]
module.keycloak_dev.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2e544bf3-bb26-479b-a8f7-0139ad2413ed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-2806"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-2806"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-2806"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-2806"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-2806"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-2806"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-2806"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-2806"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2736 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*